### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [8]:
# Dependencies and Setup
import pandas as pd

In [9]:
# File to Load (Remember to Change These)
file= "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
gamer_df= pd.read_csv(file)

In [10]:
gamer_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [11]:
Total_Players=gamer_df[["SN"]].value_counts()
Total_Players

SN
Lisosia93       5
Iral74          4
Idastidru52     4
Aina42          3
Iri67           3
               ..
Lisossala30     1
Lisossanya98    1
Lisotesta51     1
Lisovynya38     1
Adairialis76    1
Length: 576, dtype: int64

In [12]:
Total_Players = pd.DataFrame({"Total Players":[576]})
Total_Players

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [13]:
number_purchases =gamer_df["Purchase ID"].value_counts()
number_purchases

779    1
243    1
265    1
264    1
263    1
      ..
517    1
516    1
515    1
514    1
0      1
Name: Purchase ID, Length: 780, dtype: int64

In [14]:
average_price= round(gamer_df["Price"].mean(),2)
average_price

3.05

In [15]:
total_revenue= gamer_df["Price"].sum()
total_revenue

2379.77

In [16]:
unique_items= gamer_df["Item Name"].value_counts()
unique_items

Final Critic                                    13
Oathbreaker, Last Hope of the Breaking Storm    12
Persuasion                                       9
Fiery Glass Crusader                             9
Nirvana                                          9
                                                ..
Betrayer                                         1
Riddle, Tribute of Ended Dreams                  1
Exiled Mithril Longsword                         1
Ghost Reaver, Longsword of Magic                 1
Undead Crusader                                  1
Name: Item Name, Length: 179, dtype: int64

In [17]:
Purchasing_Analysis = pd.DataFrame({"Number of Unique Items":[179], "Average Price": ["$3.05"], "Number of Purchases":[780], "Total Revenue": ["$2,379.77"]})
Purchasing_Analysis

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

   Number of Unique Items Average Price Number of Purchases Total Revenue
0                     179         $3.05                 780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [18]:
#count of Genders
gender= gamer_df["Gender"].value_counts()
gender

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [19]:
#Total count of All genders
total = gender.sum()
total

780

In [27]:
#Summary of Gender Count and Percentage of players
gender_count_df =round(pd.DataFrame({"Total Count": gender,"Percentage of Players":[(652/780)*100,(113/780)*100,(15/780)*100]}),2)
gender_count_df

                       Total Count  Percentage of Players
Male                           652                  83.59
Female                         113                  14.49
Other / Non-Disclosed           15                   1.92

In [28]:
#Alternative way of showing the same data

Gender_Demo= round(pd.DataFrame({"":["Male","Female","Other/Non Disclosed"], 
                           "Total Count":[652, 113, 15],
                           "Percentage of Players":[(652/780)*100,(113/780)*100,(15/780)*100]
                          }),2)
Gender_Demo

                        Total Count  Percentage of Players
0                 Male          652                  83.59
1               Female          113                  14.49
2  Other/Non Disclosed           15                   1.92

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [29]:
purchasing_df= gamer_df[["Gender","Price"]]
purchasing_df.head()

  Gender  Price
0   Male   3.53
1   Male   1.56
2   Male   4.88
3   Male   3.27
4   Male   1.44

In [30]:
purchase_group= purchasing_df.groupby(["Gender"])
average_price= round(purchase_group.mean(),2)
average_price

                       Price
Gender
Female                  3.20
Male                    3.02
Other / Non-Disclosed   3.35

In [31]:
total_price= purchase_group.sum()
total_price

                         Price
Gender
Female                  361.94
Male                   1967.64
Other / Non-Disclosed    50.19

In [32]:
Purchasing_Analysis_df=pd.DataFrame({"Gender":["Male","Female","Other/Non Disclosed"], 
                           "Purchase Count":[652, 113, 15],
                           "Average Purchase Price":[3.02,3.20,3.35],
                            "Total Purchase Value":["$1967.64","$361.94","$50.19"]
                          })
Purchasing_Analysis_df

,Gender,Purchase Count,Average Purchase Price,Total Purchase Value
0,Male,652,3.02,$1967.64
1,Female,113,3.20,$361.94
2,Other/Non Disclosed,15,3.35,$50.19

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [121]:
age_df= gamer_df[["Age"]].head()
age_df.head()

   Age
0   20
1   40
2   24
3   24
4   23

In [122]:
age_df.sum()

Age    982
dtype: int64

In [150]:
age_df.value_counts()

Age
40   40+      4
19   15-19    3
30   30-34    3
24   20-24    2
29   25-29    2
10   10-14    2
11   10-14    2
13   10-14    2
25   25-29    2
7    <10      2
35   35-39    2
27   25-29    1
32   30-34    1
33   30-34    1
23   20-24    1
22   20-24    1
20   20-24    1
18   15-19    1
17   15-19    1
36   35-39    1
12   10-14    1
37   35-39    1
38   35-39    1
8    <10      1
44   40+      1
dtype: int64

In [123]:
#created Bins in which data will be held
bins =[0,9,14,19,24,29,34,39,50]

#names for bins

age_groups = ["<10", "10-14","15-19","20-24","25-29","30-34","35-39","40+"]

In [124]:
age_df[""]=pd.cut(age_df["Age"],bins,labels=age_groups, include_lowest= True)
age_df.head()

   Age
0   20  20-24
1   40    40+
2   24  20-24
3   24  20-24
4   23  20-24

In [125]:
total_age_df=age_df.groupby("")
total_age_df.sum()

       Age

<10     22
10-14   80
15-19   92
20-24  113
25-29  135
30-34  155
35-39  181
40+    204

In [148]:
Demographic_Summary_df=round(pd.DataFrame({"":["<10", "10-14","15-19","20-24","25-29","30-34","35-39","40+"], 
                                     "Total Count":[22,80,92,113,135,155,181,204],
                                    "Percentage of Players":[(22/982)*100,(80/982)*100,(92/982)*100,(113/982)*100,(135/982)*100,(155/982)*100,(181/982)*100,(204/982)*100],
                                   }),2)
                        
Demographic_Summary_df

          Total Count  Percentage of Players
0    <10           22                   2.24
1  10-14           80                   8.15
2  15-19           92                   9.37
3  20-24          113                  11.51
4  25-29          135                  13.75
5  30-34          155                  15.78
6  35-39          181                  18.43
7    40+          204                  20.77

       Total Count Percentage of Players
<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80